scripts/paper2/gridOpti/CaseOrigSemi3/0.orig/eps
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      eps;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.95;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    Outlet1
    {
        type            zeroGradient;
    }
    Outlet2
    {
        type            zeroGradient;
    }
    Inlet1
    {
        type            zeroGradient;
    }
    Inlet2
    {
        type            zeroGradient;
    }
    Walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
