scripts/paper2/gridOpti/CaseOrigSemi3/system/controlDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     currentTransport;

startFrom       startTime;

startTime       STARTFROM;

stopAt          endTime;

endTime         ENDTIME;

deltaT          DELTAT;

writeControl    adjustableRunTime;

writeInterval   WRITEINTERVAL;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep 	ADJUSTTIME;
maxCo 		MAXCO;
maxDeltaT	MAXDT;


functions
{
	
	line
    {
        type            sets;
        libs            (sampling);
        enabled         true;
	    writeControl    runTime;
	    writeInterval   WRITEINTERVAL;

        interpolationScheme cellPoint;
        setFormat       raw;

        fields          (alpha.gas);

        sets
        {
            s05
            {
                type            midPoint;
                axis            distance;
                start           ( 5e-3 0 15e-3 );
                end             ( 5e-3 4.45e-3 15e-3 );
            }
            s15
            {
                type            midPoint;
                axis            distance;
                start           ( 15e-3 0 15e-3 );
                end             ( 15e-3 4.45e-3 15e-3 );
            }
            s25
            {
                type            midPoint;
                axis            distance;
                start           ( 25e-3 0 15e-3 );
                end             ( 25e-3 4.45e-3 15e-3 );
            }
            s35
            {
                type            midPoint;
                axis            distance;
                start           ( 35e-3 0 15e-3 );
                end             ( 35e-3 4.45e-3 15e-3 );
            }
            s45
            {
                type            midPoint;
                axis            distance;
                start           ( 45e-3 0 15e-3 );
                end             ( 45e-3 4.45e-3 15e-3 );
            }
            s55
            {
                type            midPoint;
                axis            distance;
                start           ( 55e-3 0 15e-3 );
                end             ( 55e-3 4.45e-3 15e-3 );
            }
            s65
            {
                type            midPoint;
                axis            distance;
                start           ( 65e-3 0 15e-3 );
                end             ( 65e-3 4.45e-3 15e-3 );
            }
            s75
            {
                type            midPoint;
                axis            distance;
                start           ( 75e-3 0 15e-3 );
                end             ( 75e-3 4.45e-3 15e-3 );
            }
            s85
            {
                type            midPoint;
                axis            distance;
                start           ( 85e-3 0 15e-3 );
                end             ( 85e-3 4.45e-3 15e-3 );
            }
            s95
            {
                type            midPoint;
                axis            distance;
                start           ( 95e-3 0 15e-3 );
                end             ( 95e-3 4.45e-3 15e-3 );
            }
        }	
	}
	planeAvg
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;

        // --- what to compute
        operation       areaAverage;
        fields          (Ie Ue);          // U = vector avg; Umag = scalar avg

        // --- define the plane (sampled surface)
        regionType      sampledSurface;
        name            midPlane;          // label for the plane in outputs

        sampledSurfaceDict
        {
            type                plane;
            planeType           pointAndNormal;   // other option: pointAndTwoDirs
            pointAndNormalDict
            {
                point   (0 2.225e-3 0);
                normal (0 1 0);
            }
            // expand big bounds to ensure full cut through the domain
            triangulate         false;
            interpolate         true;
        }

        // --- when/how to write
        writeControl   runTime;           // or 'time' / 'runTime'
        writeInterval  0.2;                  // every step; change as you like
        surfaceFormat  none;               // no full surface dump, just the stats
        writeFields    false;              // don’t write sampled fields on the plane
        writeToFile    true;               // writes values to postProcessing/planeAvg/...
    }
}
// ************************************************************************* //
